# Bảng quy đổi tiết học sang giờ cụ thể
tiet_gio = {
    1: ("07:00", "07:50"),
    2: ("07:55", "08:45"),
    3: ("08:50", "09:40"),
    4: ("09:50", "10:40"),
    5: ("10:45", "11:35"),
    6: ("13:00", "13:50"),
    7: ("13:55", "14:45"),
    8: ("14:55", "15:45"),
    9: ("15:50", "16:40"),
    10: ("16:45", "17:35"),
    11: ("18:00", "18:50"),
    12: ("18:55", "19:45"),
    13: ("19:55", "20:45"),
    14: ("20:50", "21:40")
}

def quy_doi_tiet(tiet_bat_dau, tiet_ket_thuc):
    gio_bat_dau = tiet_gio[tiet_bat_dau][0]
    gio_ket_thuc = tiet_gio[tiet_ket_thuc][1]
    return gio_bat_dau, gio_ket_thuc
